import { nanoid } from 'nanoid'

function createData(name, ...rest) {
  const id = nanoid();
  return { id, name, data: [ ...rest ] };
}


export const mountingRows = [
  createData('Стандартный монтаж', "20-25 м2", "07-09", "3000 грн"),
  createData('Стандартный монтаж', "35 м2", "12", "3200 грн"),
  createData('Стандартный монтаж', "50 м2", "18", "3600 грн"),
  createData('Стандартный монтаж (сплит, кассетного, напольнопотолочного типа)', "от 70 м2", "24 - 30", "4500 грн"),
  createData('Стандартный монтаж (сплит, кассетного, напольнопотолочного типа)', "от 100 м2", "36 - 60", "6500 грн"),
];

export const mountingRowsWithoutTrails = [
  createData('Кондиционер', "20-25 м2", "07-09", "1500 грн"),
  createData('Кондиционер', "35 м2", "12", "1700 грн"),
  createData('Кондиционер', "50 м2", "18", "2000 грн"),
  createData('Кондиционер (сплит, кассетного, напольнопотолочного типа)', "от 70 м2", "24 - 30", "от 2500 грн"),
  createData('Кондиционер (сплит, кассетного, напольнопотолочного типа)', "от 100 м2", "36 - 60", "от 3500 грн"),
];

export const mountingHeader = [ 'Вид работ', 'Условная площадь помещения', 'Мощность  кондиционера,  btu', 'Стоимость, грн' ]


export const maintenanceRows = [
  createData('Чистка внутреннего блока, ТО', "20-25 м2", "07-09", "500 грн"),
  createData('Чистка внутреннего блока, ТО', "35 м2", "12", "600 грн"),
  createData('Чистка внутреннего блока, ТО', "50 м2", "18", "800 грн"),
  createData('Чистка внутреннего блока, ТО', "от 70 м2", "24 - 30", "1000 грн"),
  createData('Чистка наружного блока парогенератором', null, null, "200 грн"),
  createData('Мойка наружного блока керхером', null, null, "200 грн"),
  createData('Запрака фреоном R - 22, R - 410, R- 32', null, null, "100 гр/ 100 грн"),
  createData('Вакуумирование системы', null, null, "150 грн"),
  createData('Вальцовка соединения (при выявлении утечки фреона)', null, null, "1 шт/ 100 грн")
];

export const maintenanceHeader = [ 'Вид работ', 'Условная площадь помещения', 'Мощность  кондиционера,  btu', 'Стоимость, грн' ];


export const trailRows = [
  createData('Монтаж фреоновой магистрали, длинной до 3 м.п.', "20-25 м2", "07-09", "1500 грн"),
  createData('Монтаж фреоновой магистрали, длинной до 3 м.п.', "35 м2", "12", "1600 грн"),
  createData('Монтаж фреоновой магистрали, длинной до 3 м.п.', "50 м2", "18", "1900 грн"),
  createData('Монтаж фреоновой магистрали, длинной до 3 м.п.', "от 70 м2", "24 - 30", "2400 грн")
];

export const trailRowsAdditionalWorks = [
  createData('Штробление стен под фреономагистраль ( кирпич, газоблок)', "м.п.", "1", "150 грн"),
  createData('Штробление стен под фреономагистраль ( бетон)', "м.п.", "1", "250 грн"),
  createData('Штробление стен под дренажную трубу', "м.п.", "1", "60 грн"),
  createData('Дополнительное отверстие под фреономагистраль (кирпич)', "м.п.", "1", "150 грн"),
  createData('Дополнительное отверстие под фреономагистраль (бетон)', "м.п.", "1", "250 грн"),
  createData('Монтаж/демонтаж стеклопакета', "м.п.", "1", "150 грн"),
];

export const trailRowsAdditionalMaterial = [
  createData('Фреономагистраль', "м.п.", "20-25 м2", "07-09", "300 грн"),
  createData('Фреономагистраль', "м.п.", "35 м2", "12", "400 грн"),
  createData('Фреономагистраль', "м.п.", "50 м2", "18", "450 грн"),
  createData('Фреономагистраль', "м.п.", "от 70 м2", "24 - 30", "550 грн"),
  createData('Дренажная труба D 16', "м.п.", null, null, "40 грн"),
  createData('Короб-канал 60х60', "м.п.", null, null, "100 грн"),
];

export const trailHeader = [ 'Вид работ', 'Условная площадь помещения', 'Мощность  кондиционера,  btu', 'Стоимость, грн' ]

export const trailHeaderAdditionalWorks = [ 'Вид работ', 'Единица измерения ', 'Кол-во', 'Стоимость, грн' ]

export const trailHeaderAdditionalMaterial = [ 'Материалы', 'Единица измерения ', 'Условная площадь помещения', 'Мощность  кондиционера,  btu', 'Стоимость, грн' ]


export const dismantlingRows = [
  createData('Демонтаж бытовых кондиционеров 7-12 tbtu', "600 грн"),
  createData('Демонтаж настенных кондиционеров 18-36 tbtu', "700 грн"),
  createData('Демонтаж напольно-потолочных кондиционеров 18-24 btu', "900 грн"),
  createData('Демонтаж кассетных, канальных, кондиционеров 18-24 btu', "900 грн"),
  createData('Демонтаж полупромышленной серии кондиционеров 30-60 btu', "1200 грн"),
  createData('Демонтаж бытовых кондиционеров   7-12 tbtu, более 2 шт', "600 грн"),
  createData('Демонтаж настенных кондиционеров 18-36 tbtu, более 2 шт', "700 грн"),
  createData('Демонтаж напольно-потолочных кондиционеров 18-24 btu, более 2 шт', "900 грн"),
  createData('Демонтаж кассетных, канальных,  кондиционеров 18-24 btu, более 2 шт', "900 грн"),
  createData('Демонтаж полупромышленной серии кондиционеров 30-60 btu, более 2 шт', "1200 грн")
];

export const dismantlingHeader = [ 'Услуга', 'Стоимость, грн' ]

